

day_v = """ С Днём Победы!

В этот день мы чтим подвиг тех, кто боролся за свободу — и продолжаем ценить свободу сегодня.

В честь 9 мая дарим специальные скидки на Outline VPN:

✨ -50% на первый месяц
🎁 -20% на годовой план

Пусть ваша свобода в интернете будет защищена!

⏳ Акция действует только 9 мая!
/start — чтобы выбрать тариф и получить ваш VPN-ключ

С праздником, мира и спокойствия вам и вашим близким. 🎖️"""

holiday_text = """🌼 Майские праздники — время отдохнуть, выдохнуть и насладиться весной!

В честь праздников дарим вам приятные скидки на Outline VPN:

✨ -50% на первый месяц  
🎁 -20% на годовой план

⏳ Акция действует до конца майских выходных!  
/start — чтобы выбрать тариф и получить ваш персональный VPN-ключ

Хорошего отдыха, солнца и весеннего настроения! 🌞"""

#text_price = f'Локация Нидерланды\n\n1 месяц - {one_month} рублей\n3 месяца - {three_months} рублей\n6 месяцев - {six_months} рублей\n1 год - {one_year} рублей'
discount_month = """ Привет! 👋

Спасибо, что воспользовались пробным периодом! У нас для вас эксклюзивная скидка 50% на первый месяц использования Outline VPN — но действует она ‼️Только в течение ближайших 24 часов‼️ ⏳

/start

Чтобы продолжить и получить ключ для безопасного серфинга, выберите подходящий вариант ниже и следуйте простым инструкциям.

Если появятся вопросы — пишите, мы всегда на связи! 😊"""
start_message =  """
Приветствуем вас! 👋  

У нас отличные новости!  
Персональная скидка на тариф 1 месяц.
Теперь мы работаем на новом сервере с выделенным каналом в 1 Гбит/с — это значит, что ваши скорости стали выше, соединение — стабильнее, а впечатления от серфинга — приятнее.

Чтобы приобрести ключ и начать пользоваться, выберите подходящий вариант ниже и следуйте простым инструкциям.  
Если возникнут вопросы — мы всегда на связи и готовы помочь! 😊
"""


free_text = 'Вам выдан тестовый ключ на 1 GB'

user_agreemeent = 'Используя ключ, вы соглашаетесь с условиями данного Соглашения.'
agreemeent = """Используя ключ, вы соглашаетесь с условиями данного Соглашения.\n1. Пользователь обязуется использовать VPN только в соответствии с законодательством страны, в которой он находится.\n\n
2. Запрещается использовать VPN для любых незаконных действий, включая обход блокировок, доступ к запрещённому контенту, а также деятельность, нарушающую права третьих лиц.\n\n
3. Пользователь несет полную ответственность за все действия, совершенные через VPN, включая возможные правовые последствия.\n\n
4. Провайдер VPN не несет ответственности за нарушение пользователем законодательства"""

instruction_text = """
    1. Скачайте программу Outline для своей платформы:
       - [Android](https://play.google.com/store/apps/details?id=org.outline.android.client)
       - [iOS](https://apps.apple.com/ru/app/outline-app/id1356177741)
       - [Windows](https://outline-vpn.com/download.php?os=c_windows)
       - [macOS](https://apps.apple.com/us/app/outline-secure-internet-access/id1356178125?mt=12)
    
2. Получите ключ, доступный для Outline, после оплаты.

3. Вставьте полученный ключ в приложение.
    """
ny_text = """Поздравляем Вас с наступающими праздниками! 🎄
К новогоднему сезону мы подготовили специальные предложения.

Новогодний тариф:
🎁 26 месяцев со скидкой 50%
    6422 ₽-50%  3211 ₽!

✨ Персональная скидка на тариф 1 месяц 

❄️Скидка 26% на тарифы от 3 месяцев и выше

до 31.01.2026
"""
